// модуль 2

// задача 1
// function checkAge(age) {
//     if (age>=18) { // Дополни эту строку
//       return 'Вы совершеннолетний человек';
//     }
  
//     return 'Вы не совершеннолетний человек';
//   }


// задача 2
// function checkPassword(password) {
//     const ADMIN_PASSWORD = 'jqueryismyjam';
//     // Пиши код ниже этой строки
    
  
//     if (password === ADMIN_PASSWORD) {
//       return  'Добро пожаловать!';
      
   
//     }
  
//     return 'Доступ запрещен, неверный пароль!';
//     // Пиши код выше этой строки
//   }

// задача 3

//   function checkStorage(available, ordered) {
//     // Пиши код ниже этой строки
    
  
//     if (ordered === 0) {
//       return  'В заказе еще нет товаров';
//     } 
//     if (ordered > available) {
//       return 'Слишком большой заказ, на складе недостаточно товаров!';
//     }
//       return 'Заказ оформлен, с вами свяжется менеджер';
  
//     // Пиши код выше этой строки
//   }

// задача 4
    // Пиши код ниже этой строки
// const fruits =['яблоко', 'слива', 'груша','апельсин'];

// задача 5
// Стартовый код
// Стартовый код
// const fruits = ['яблоко', 'слива', 'груша', 'апельсин'];
// // Пиши код ниже этой строки
// const firstElement =fruits[0];
// const secondElement =fruits[1];
// const lastElement =fruits[3];


// задача 6
// Стартовый код
// const fruits = ['яблоко', 'слива', 'груша', 'апельсин'];
// // Пиши код ниже этой строки
// fruits[1]='персик';
// fruits[3]='банан';


// задача 7
//     // Стартовый код
// const fruits = ['яблоко', 'персик', 'груша', 'банан'];
// // Пиши код ниже этой строки
// const fruitsArrayLength = fruits.length;

// задача 8

// Стартовый код
// const fruits = ['яблоко', 'персик', 'груша', 'банан'];
// // Пиши код ниже этой строки
// const lastElementIndex =fruits.length -1;
// const lastElement = fruits[lastElementIndex] ;
// задача 9
// задача 10
// задача 11
// задача 12
// задача 13 
// задача 14
// задача 15
// задача 16
// задача 17
// задача 18
// задача 19
// задача 20
// задача 21
// задача 22
// задача 23 
// задача 24 
// задача 25
// задача 26
// задача 27
// задача 28
// задача 29
// задача 30
// задача 31 
// задача 32
